Revit 2027 API
ConnectorElement.CreateCableTrayConnector Method
Overload List
Name | Description
CreateCableTrayConnector(Document, Reference) |  Create a new cable tray ConnectorElement.
CreateCableTrayConnector(Document, Reference, Edge) |  Create a new cable tray ConnectorElement.
Top
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace